In [1]:
import numpy as np
import pandas as pd

In [2]:
import pandas as pd

In [3]:
import pandas as pd
pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv')

   a    b   c   d   names
0   1   3   4   5     ram
1   6   7   8   9   radha
2  10  11  12  13  shyama

In [16]:
pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv',header=None ,)

    0   1   2   3       4
0  a    b   c   d   names
1   1   3   4   5     ram
2   6   7   8   9   radha
3  10  11  12  13  shyama

In [7]:
import pandas as pd
df= pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv' )
df

   a    b   c   d   names
0   1   3   4   5     ram
1   6   7   8   9   radha
2  10  11  12  13  shyama

In [14]:
#skiprows
df= pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv' , skiprows=[0,1])
df

    6   7   8   9   radha
0  10  11  12  13  shyama

In [18]:
df= pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv' ,  )
df

   a    b   c   d   names
0   1   3   4   5     ram
1   6   7   8   9   radha
2  10  11  12  13  shyama

In [19]:
#isnull=used to fingfd null values-------if nullvalues the true
pd.isnull(df)

      a       b      c      d  names
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False

In [21]:
#na_values=[]-------shows NaN in the place of a
df= pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv' , na_values=[1] )
df

     a    b   c   d   names
0   NaN   3   4   5     ram
1   6.0   7   8   9   radha
2  10.0  11  12  13  shyama

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type('a')

str

In [27]:
df.dtypes

a        float64
b          int64
c          int64
d          int64
names     object
dtype: object

In [31]:
#show only particular coloumn
df['d']

0     5
1     9
2    13
Name: d, dtype: int64

In [32]:
#n_rows=int ===============shows int rows
df= pd.read_csv(r'C:\Users\prince\Desktop\test1\ex1.csv' , nrows=1 )
df

   a   b  c  d names
0   1  3  4  5   ram

In [36]:
#data range

dates=pd.date_range('1/1/2000',periods=10, freq='y')
dates

DatetimeIndex(['2000-12-31', '2001-12-31', '2002-12-31', '2003-12-31',
               '2004-12-31', '2005-12-31', '2006-12-31', '2007-12-31',
               '2008-12-31', '2009-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [37]:
#Series and arange
#series shows things in a series form
#arange generates that number of range
ts=pd.Series(np.arange(7))
ts

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

In [39]:
#when we do notm us series then we get the value in the array model.
np.arange(7)

array([0, 1, 2, 3, 4, 5, 6])